{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "В этом задании нужно написать программу, которая найдет в тексте ряд простых арифметических выражений и подсчитает их.\n",
    "\n",
    "Любое выражение начинается с имени переменной a, b или c, затем может идти + или -, затем идет =, \n",
    "затем может идти имя переменной a, b или c, а затем может идти + или - и целое число. \n",
    "Если в правой части выражения нет переменной, то число может быть без знака + или -\n",
    "\n",
    "Не бывает названий переменных, кроме a, b или c, и действий, кроме описанных тут. \n",
    "Не бывает пробелов вокруг знаков. В тексте не встречаются некорректные выражения, \n",
    "в которых справа от = нет ни переменной, ни числа. Таким образом, список типов выражений, \n",
    "которые могут встречаться, выглядит примерно так:\n",
    "\n",
    "a=1, a=+1, a=-1, a=b, a=b+100, a=b-100, b+=10, b+=+10, b+=-10, b+=b, b+=b+100, b+=b-100, \n",
    "c-=101, c-=+101, c-=-101, c-=b, c-=b+101, c-=b-101\n",
    "\n",
    "Выражения могут встречаться внутри текста, например loremc-=a+10ipsuma-=adb+=10olorsitamet.\n",
    "\n",
    "В вашу функцию calculate(data, findall) будет передан словарь с начальными значениями переменных a, b и c: \n",
    "    data = {\"a\":1, \"b\":2, \"c\": 3} и ссылка на функцию findall, \n",
    "    а вы должны вернуть такой же словарь с новыми значениями для a, b и c.\n",
    "\n",
    "Работает findall() аналогично re.findall(), только у нее всего один параметр – регулярное выражение. \n",
    "А текст, в котором она будет искать выражения, она знает сама (см. приложенный архив, чтобы понять, о чем речь). \n",
    "С помощью findall() нужно как минимум найти все выражения в тексте, а как максимум найти их и разбить на группы так, \n",
    "чтобы было удобно их обработать. Если findall() будет вызвано больше одного раза или если размер списка, который она вернет, \n",
    "будет отличаться от количества выражений в тексте, тест провалится.\n",
    "\n",
    "Эталонное решение занимает 11 строк, не содержит импортов, не использует eval, \n",
    "а регулярное выражение находит выражения и бьет каждое на четыре группы \n",
    "(некоторые группы для некоторых выражений оказываются пустыми):\n",
    "\n",
    "Имя переменной слева.\n",
    "Знак перед = (если есть).\n",
    "Имя переменной справа (если есть).\n",
    "Число (если есть) со знаком (если есть).\n",
    "Это позволяет легко (буквально в одну строку) посчитать правую часть, а потом, \n",
    "в зависимости от наличия знака перед =, произвести действие с левой частью. \n",
    "Однако ваш алгоритм может быть другим, требуется только выполнить ограничения на вызов findall() \n",
    "и оставить сигнатуру calculate() неизменной. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def calculate(data, findall):\n",
    "    matches = findall(r\"([abc])([+-]?)=([abc])?([+-]?\\d+)?\")\n",
    "    for a, s, b, n in matches:\n",
    "        right = data.get(b, 0) + int(n or 0)\n",
    "        if s == \"-\":\n",
    "            data[a] -= right\n",
    "        elif s == \"+\":\n",
    "            data[a] += right\n",
    "        else:\n",
    "            data[a] = right\n",
    "    return data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Correct\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "\n",
    "\n",
    "def findall(regexp):\n",
    "    text = \"\"\"\n",
    "    a=1\n",
    "    a=+1\n",
    "    a=-1\n",
    "    a=b\n",
    "    a=b+100\n",
    "    a=b-100\n",
    "    \n",
    "    b+=10\n",
    "    b+=+10\n",
    "    b+=-10\n",
    "    b+=b\n",
    "    b+=b+100\n",
    "    b+=b-100\n",
    "    \n",
    "    c-=101\n",
    "    c-=+101\n",
    "    c-=-101\n",
    "    c-=b\n",
    "    c-=b+101\n",
    "    c-=b-101\n",
    "    \"\"\"\n",
    "\n",
    "    return re.findall(regexp, text)\n",
    "\n",
    "\n",
    "result = calculate({'a': 1, 'b': 2, 'c': 3}, findall)\n",
    "correct = {\"a\": -98, \"b\": 196, \"c\": -686}\n",
    "if result == correct:\n",
    "    print (\"Correct\")\n",
    "else:\n",
    "    print (\"Incorrect: %s != %s\" % (result, correct))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
